Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/edc/PIC32MK1024GPD100.PIC
      <edc:SFRDef edc:_addr="0x1F800050" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02481_WACJ_Config.Module" edc:_refcount="2" edc:access="-----------n-nnn-----------nnnnn" edc:cname="PMD2" edc:desc="" edc:impl="0x17001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------u-uuu-----------uuu00" edc:name="PMD2" edc:nzwidth="0x20" edc:por="-----------x-xxx-----------xxx00" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP3MD" edc:mask="0x1" edc:name="CMP3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP4MD" edc:mask="0x1" edc:name="CMP4MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP5MD" edc:mask="0x1" edc:name="CMP5MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="OPA1MD" edc:mask="0x1" edc:name="OPA1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPA2MD" edc:mask="0x1" edc:name="OPA2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPA3MD" edc:mask="0x1" edc:name="OPA3MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OPA5MD" edc:mask="0x1" edc:name="OPA5MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800060" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02481_WACJ_Config.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMD3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuu000000000uuuuuuu000000000" edc:name="PMD3" edc:nzwidth="0x20" edc:por="xxxxxxx000000000xxxxxxx000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC1MD" edc:desc="" edc:mask="0x1" edc:name="IC1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2MD" edc:desc="" edc:mask="0x1" edc:name="IC2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3MD" edc:desc="" edc:mask="0x1" edc:name="IC3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4MD" edc:desc="" edc:mask="0x1" edc:name="IC4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5MD" edc:desc="" edc:mask="0x1" edc:name="IC5MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6MD" edc:desc="" edc:mask="0x1" edc:name="IC6MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7MD" edc:desc="" edc:mask="0x1" edc:name="IC7MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8MD" edc:desc="" edc:mask="0x1" edc:name="IC8MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9MD" edc:desc="" edc:mask="0x1" edc:name="IC9MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC10MD" edc:mask="0x1" edc:name="IC10MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC11MD" edc:mask="0x1" edc:name="IC11MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC12MD" edc:mask="0x1" edc:name="IC12MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC13MD" edc:mask="0x1" edc:name="IC13MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC14MD" edc:mask="0x1" edc:name="IC14MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC15MD" edc:mask="0x1" edc:name="IC15MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC16MD" edc:mask="0x1" edc:name="IC16MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC1MD" edc:desc="" edc:mask="0x1" edc:name="OC1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2MD" edc:desc="" edc:mask="0x1" edc:name="OC2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3MD" edc:desc="" edc:mask="0x1" edc:name="OC3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4MD" edc:desc="" edc:mask="0x1" edc:name="OC4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5MD" edc:desc="" edc:mask="0x1" edc:name="OC5MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC6MD" edc:desc="" edc:mask="0x1" edc:name="OC6MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC7MD" edc:desc="" edc:mask="0x1" edc:name="OC7MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC8MD" edc:desc="" edc:mask="0x1" edc:name="OC8MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC9MD" edc:desc="" edc:mask="0x1" edc:name="OC9MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC10MD" edc:mask="0x1" edc:name="OC10MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC11MD" edc:mask="0x1" edc:name="OC11MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC12MD" edc:mask="0x1" edc:name="OC12MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC13MD" edc:mask="0x1" edc:name="OC13MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC14MD" edc:mask="0x1" edc:name="OC14MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC15MD" edc:mask="0x1" edc:name="OC15MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC16MD" edc:mask="0x1" edc:name="OC16MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800070" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02481_WACJ_Config.Module" edc:_refcount="2" edc:access="-----------------------nnnnnnnnn" edc:cname="PMD4" edc:desc="" edc:impl="0x1ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="PMD4" edc:nzwidth="0x20" edc:por="-----------------------111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T1MD" edc:desc="" edc:mask="0x1" edc:name="T1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2MD" edc:desc="" edc:mask="0x1" edc:name="T2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3MD" edc:desc="" edc:mask="0x1" edc:name="T3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4MD" edc:desc="" edc:mask="0x1" edc:name="T4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5MD" edc:desc="" edc:mask="0x1" edc:name="T5MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6MD" edc:desc="" edc:mask="0x1" edc:name="T6MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T7MD" edc:desc="" edc:mask="0x1" edc:name="T7MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T8MD" edc:desc="" edc:mask="0x1" edc:name="T8MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T9MD" edc:desc="" edc:mask="0x1" edc:name="T9MD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
