Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/edc/PIC32MK1024GPD100.PIC
      <edc:SFRDef edc:_addr="0x1F801620" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="7" edc:access="---------------------------nnnnn" edc:cname="RPA8R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA8R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA8R" edc:desc="" edc:mask="0x1f" edc:name="RPA8R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801624" edc:offset="0x08"/>
      <edc:SFRDef edc:_addr="0x1F80162C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="8" edc:access="---------------------------nnnnn" edc:cname="RPA11R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA11R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA11R" edc:desc="" edc:mask="0x1f" edc:name="RPA11R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801630" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="9" edc:access="---------------------------nnnnn" edc:cname="RPA12R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA12R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA12R" edc:desc="" edc:mask="0x1f" edc:name="RPA12R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801634" edc:offset="0x04"/>
      <edc:SFRDef edc:_addr="0x1F801638" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="10" edc:access="---------------------------nnnnn" edc:cname="RPA14R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA14R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA14R" edc:desc="" edc:mask="0x1f" edc:name="RPA14R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80163C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="11" edc:access="---------------------------nnnnn" edc:cname="RPA15R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA15R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA15R" edc:desc="" edc:mask="0x1f" edc:name="RPA15R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801640" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="12" edc:access="---------------------------nnnnn" edc:cname="RPB0R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPB0R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB0R" edc:desc="" edc:mask="0x1f" edc:name="RPB0R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801644" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="13" edc:access="---------------------------nnnnn" edc:cname="RPB1R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPB1R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB1R" edc:desc="" edc:mask="0x1f" edc:name="RPB1R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801648" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="14" edc:access="---------------------------nnnnn" edc:cname="RPB2R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPB2R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB2R" edc:desc="" edc:mask="0x1f" edc:name="RPB2R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80164C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="15" edc:access="---------------------------nnnnn" edc:cname="RPB3R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPB3R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB3R" edc:desc="" edc:mask="0x1f" edc:name="RPB3R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
