Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/edc/PIC32MK1024GPD100.PIC
      <edc:SFRDef edc:_addr="0x1F8602D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------n---n-nnnn------" edc:cname="SRCON1C" edc:desc="" edc:impl="0x8bc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-0000------" edc:name="SRCON1C" edc:nzwidth="32" edc:por="----------------0---0-0000------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1C6" edc:mask="0x1" edc:name="SR1C6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C7" edc:mask="0x1" edc:name="SR1C7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C8" edc:mask="0x1" edc:name="SR1C8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C9" edc:mask="0x1" edc:name="SR1C9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1C11" edc:mask="0x1" edc:name="SR1C11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1C15" edc:mask="0x1" edc:name="SR1C15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8602E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F860300" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nn--------------" edc:cname="ANSELD" edc:desc="" edc:grp="PORTD" edc:impl="0xffffc000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------11--------------" edc:name="ANSELD" edc:nzwidth="0x20" edc:por="----------------11--------------" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSD14" edc:desc="" edc:mask="0x1" edc:name="ANSD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSD15" edc:desc="" edc:mask="0x1" edc:name="ANSD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860310" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnn---n-nnnnnn-" edc:cname="TRISD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffff17e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111---1-111111-" edc:name="TRISD" edc:nzwidth="0x20" edc:por="----------------1111---1-111111-" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISD1" edc:desc="" edc:mask="0x1" edc:name="TRISD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD2" edc:desc="" edc:mask="0x1" edc:name="TRISD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD3" edc:desc="" edc:mask="0x1" edc:name="TRISD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD4" edc:desc="" edc:mask="0x1" edc:name="TRISD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD5" edc:desc="" edc:mask="0x1" edc:name="TRISD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD6" edc:desc="" edc:mask="0x1" edc:name="TRISD6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISD8" edc:desc="" edc:mask="0x1" edc:name="TRISD8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISD12" edc:desc="" edc:mask="0x1" edc:name="TRISD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISD13" edc:desc="" edc:mask="0x1" edc:name="TRISD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISD14" edc:desc="" edc:mask="0x1" edc:name="TRISD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD15" edc:desc="" edc:mask="0x1" edc:name="TRISD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860320" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnn---n-nnnnnn-" edc:cname="PORTD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffff17e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx---x-xxxxxx-" edc:name="PORTD" edc:nzwidth="0x20" edc:por="----------------xxxx---x-xxxxxx-" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RD1" edc:desc="" edc:mask="0x1" edc:name="RD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD2" edc:desc="" edc:mask="0x1" edc:name="RD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD3" edc:desc="" edc:mask="0x1" edc:name="RD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD4" edc:desc="" edc:mask="0x1" edc:name="RD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD5" edc:desc="" edc:mask="0x1" edc:name="RD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD6" edc:desc="" edc:mask="0x1" edc:name="RD6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RD8" edc:desc="" edc:mask="0x1" edc:name="RD8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RD12" edc:desc="" edc:mask="0x1" edc:name="RD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RD13" edc:desc="" edc:mask="0x1" edc:name="RD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RD14" edc:desc="" edc:mask="0x1" edc:name="RD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD15" edc:desc="" edc:mask="0x1" edc:name="RD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860330" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnn---n-nnnnnn-" edc:cname="LATD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffff17e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx---x-xxxxxx-" edc:name="LATD" edc:nzwidth="0x20" edc:por="----------------xxxx---x-xxxxxx-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATD1" edc:desc="" edc:mask="0x1" edc:name="LATD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD2" edc:desc="" edc:mask="0x1" edc:name="LATD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD3" edc:desc="" edc:mask="0x1" edc:name="LATD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD4" edc:desc="" edc:mask="0x1" edc:name="LATD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD5" edc:desc="" edc:mask="0x1" edc:name="LATD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD6" edc:desc="" edc:mask="0x1" edc:name="LATD6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATD8" edc:desc="" edc:mask="0x1" edc:name="LATD8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATD12" edc:desc="" edc:mask="0x1" edc:name="LATD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATD13" edc:desc="" edc:mask="0x1" edc:name="LATD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATD14" edc:desc="" edc:mask="0x1" edc:name="LATD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD15" edc:desc="" edc:mask="0x1" edc:name="LATD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860340" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnn---n-nnnnnn-" edc:cname="ODCD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffff17e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000---0-000000-" edc:name="ODCD" edc:nzwidth="0x20" edc:por="----------------0000---0-000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCD1" edc:desc="" edc:mask="0x1" edc:name="ODCD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD2" edc:desc="" edc:mask="0x1" edc:name="ODCD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD3" edc:desc="" edc:mask="0x1" edc:name="ODCD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD4" edc:desc="" edc:mask="0x1" edc:name="ODCD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD5" edc:desc="" edc:mask="0x1" edc:name="ODCD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD6" edc:desc="" edc:mask="0x1" edc:name="ODCD6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCD8" edc:desc="" edc:mask="0x1" edc:name="ODCD8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCD12" edc:desc="" edc:mask="0x1" edc:name="ODCD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCD13" edc:desc="" edc:mask="0x1" edc:name="ODCD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCD14" edc:desc="" edc:mask="0x1" edc:name="ODCD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD15" edc:desc="" edc:mask="0x1" edc:name="ODCD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860350" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnn---n-nnnnnn-" edc:cname="CNPUD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffff17e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000---0-000000-" edc:name="CNPUD" edc:nzwidth="0x20" edc:por="----------------0000---0-000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUD1" edc:desc="" edc:mask="0x1" edc:name="CNPUD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD2" edc:desc="" edc:mask="0x1" edc:name="CNPUD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD3" edc:desc="" edc:mask="0x1" edc:name="CNPUD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD4" edc:desc="" edc:mask="0x1" edc:name="CNPUD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD5" edc:desc="" edc:mask="0x1" edc:name="CNPUD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD6" edc:desc="" edc:mask="0x1" edc:name="CNPUD6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUD8" edc:desc="" edc:mask="0x1" edc:name="CNPUD8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUD12" edc:desc="" edc:mask="0x1" edc:name="CNPUD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD13" edc:desc="" edc:mask="0x1" edc:name="CNPUD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD14" edc:desc="" edc:mask="0x1" edc:name="CNPUD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD15" edc:desc="" edc:mask="0x1" edc:name="CNPUD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860360" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnn---n-nnnnnn-" edc:cname="CNPDD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffff17e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000---0-000000-" edc:name="CNPDD" edc:nzwidth="0x20" edc:por="----------------0000---0-000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDD1" edc:desc="" edc:mask="0x1" edc:name="CNPDD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD2" edc:desc="" edc:mask="0x1" edc:name="CNPDD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD3" edc:desc="" edc:mask="0x1" edc:name="CNPDD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD4" edc:desc="" edc:mask="0x1" edc:name="CNPDD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD5" edc:desc="" edc:mask="0x1" edc:name="CNPDD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD6" edc:desc="" edc:mask="0x1" edc:name="CNPDD6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDD8" edc:desc="" edc:mask="0x1" edc:name="CNPDD8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDD12" edc:desc="" edc:mask="0x1" edc:name="CNPDD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD13" edc:desc="" edc:mask="0x1" edc:name="CNPDD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD14" edc:desc="" edc:mask="0x1" edc:name="CNPDD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD15" edc:desc="" edc:mask="0x1" edc:name="CNPDD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
