Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/edc/PIC32MK1024GPD100.PIC
      <edc:SFRDef edc:_addr="0x1F8870A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCSS1" edc:desc="" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000000000000000000" edc:name="ADCCSS1" edc:nzwidth="32" edc:por="----0000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSS0" edc:mask="0x1" edc:name="CSS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS1" edc:mask="0x1" edc:name="CSS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS2" edc:mask="0x1" edc:name="CSS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS3" edc:mask="0x1" edc:name="CSS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS4" edc:mask="0x1" edc:name="CSS4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS5" edc:mask="0x1" edc:name="CSS5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS6" edc:mask="0x1" edc:name="CSS6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS7" edc:mask="0x1" edc:name="CSS7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS8" edc:mask="0x1" edc:name="CSS8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS9" edc:mask="0x1" edc:name="CSS9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS10" edc:mask="0x1" edc:name="CSS10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS11" edc:mask="0x1" edc:name="CSS11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS12" edc:mask="0x1" edc:name="CSS12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS13" edc:mask="0x1" edc:name="CSS13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS14" edc:mask="0x1" edc:name="CSS14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS15" edc:mask="0x1" edc:name="CSS15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS16" edc:mask="0x1" edc:name="CSS16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS17" edc:mask="0x1" edc:name="CSS17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS18" edc:mask="0x1" edc:name="CSS18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS19" edc:mask="0x1" edc:name="CSS19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS20" edc:mask="0x1" edc:name="CSS20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS21" edc:mask="0x1" edc:name="CSS21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS22" edc:mask="0x1" edc:name="CSS22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS23" edc:mask="0x1" edc:name="CSS23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS24" edc:mask="0x1" edc:name="CSS24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS25" edc:mask="0x1" edc:name="CSS25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS26" edc:mask="0x1" edc:name="CSS26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS27" edc:mask="0x1" edc:name="CSS27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8870B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:access="----------nnnnnnnnn---nnnnnnnnn-" edc:cname="ADCCSS2" edc:desc="" edc:impl="0x3fe3fe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000000---000000000-" edc:name="ADCCSS2" edc:nzwidth="32" edc:por="----------000000000---000000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CSS33" edc:mask="0x1" edc:name="CSS33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS34" edc:mask="0x1" edc:name="CSS34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS35" edc:mask="0x1" edc:name="CSS35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS36" edc:mask="0x1" edc:name="CSS36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS37" edc:mask="0x1" edc:name="CSS37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS38" edc:mask="0x1" edc:name="CSS38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS39" edc:mask="0x1" edc:name="CSS39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS40" edc:mask="0x1" edc:name="CSS40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS41" edc:mask="0x1" edc:name="CSS41" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CSS45" edc:mask="0x1" edc:name="CSS45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS46" edc:mask="0x1" edc:name="CSS46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS47" edc:mask="0x1" edc:name="CSS47" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS48" edc:mask="0x1" edc:name="CSS48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS49" edc:mask="0x1" edc:name="CSS49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS50" edc:mask="0x1" edc:name="CSS50" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS51" edc:mask="0x1" edc:name="CSS51" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS52" edc:mask="0x1" edc:name="CSS52" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS53" edc:mask="0x1" edc:name="CSS53" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8870C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:access="----rrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ADCDSTAT1" edc:desc="" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000000000000000000" edc:name="ADCDSTAT1" edc:nzwidth="32" edc:por="----0000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ARDY0" edc:mask="0x1" edc:name="ARDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY1" edc:mask="0x1" edc:name="ARDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY2" edc:mask="0x1" edc:name="ARDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY3" edc:mask="0x1" edc:name="ARDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY4" edc:mask="0x1" edc:name="ARDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY5" edc:mask="0x1" edc:name="ARDY5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY6" edc:mask="0x1" edc:name="ARDY6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY7" edc:mask="0x1" edc:name="ARDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY8" edc:mask="0x1" edc:name="ARDY8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY9" edc:mask="0x1" edc:name="ARDY9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY10" edc:mask="0x1" edc:name="ARDY10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY11" edc:mask="0x1" edc:name="ARDY11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY12" edc:mask="0x1" edc:name="ARDY12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY13" edc:mask="0x1" edc:name="ARDY13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY14" edc:mask="0x1" edc:name="ARDY14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY15" edc:mask="0x1" edc:name="ARDY15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY16" edc:mask="0x1" edc:name="ARDY16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY17" edc:mask="0x1" edc:name="ARDY17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY18" edc:mask="0x1" edc:name="ARDY18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY19" edc:mask="0x1" edc:name="ARDY19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY20" edc:mask="0x1" edc:name="ARDY20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY21" edc:mask="0x1" edc:name="ARDY21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY22" edc:mask="0x1" edc:name="ARDY22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY23" edc:mask="0x1" edc:name="ARDY23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY24" edc:mask="0x1" edc:name="ARDY24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY25" edc:mask="0x1" edc:name="ARDY25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY26" edc:mask="0x1" edc:name="ARDY26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY27" edc:mask="0x1" edc:name="ARDY27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8870D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:access="----------rrrrrrrrr---rrrrrrrrr-" edc:cname="ADCDSTAT2" edc:desc="" edc:impl="0x3fe3fe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000000---000000000-" edc:name="ADCDSTAT2" edc:nzwidth="32" edc:por="----------000000000---000000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ARDY33" edc:mask="0x1" edc:name="ARDY33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY34" edc:mask="0x1" edc:name="ARDY34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY35" edc:mask="0x1" edc:name="ARDY35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY36" edc:mask="0x1" edc:name="ARDY36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY37" edc:mask="0x1" edc:name="ARDY37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY38" edc:mask="0x1" edc:name="ARDY38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY39" edc:mask="0x1" edc:name="ARDY39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY40" edc:mask="0x1" edc:name="ARDY40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY41" edc:mask="0x1" edc:name="ARDY41" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ARDY45" edc:mask="0x1" edc:name="ARDY45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY46" edc:mask="0x1" edc:name="ARDY46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY47" edc:mask="0x1" edc:name="ARDY47" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY48" edc:mask="0x1" edc:name="ARDY48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY49" edc:mask="0x1" edc:name="ARDY49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY50" edc:mask="0x1" edc:name="ARDY50" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY51" edc:mask="0x1" edc:name="ARDY51" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY52" edc:mask="0x1" edc:name="ARDY52" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY53" edc:mask="0x1" edc:name="ARDY53" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
